import styled from "styled-components";

export const ACCOUNT = "1002-364-221277 우리은행 이승주(어바웃)";
export const ACCOUNT_SHORT = "1002-364-221277 우리은행 어바웃";

export const PromotionComponent = () => (
  <P>
    ☕️대학생들의 카공 및 친목 동아리☕️ <br />
    <br /> 카공 스터디는 많지만 제대로 운영되는 스터디 모임은 거의 없다는 걸
    아시나요? 저희 About는 근처에 사는 대학생들이 편하게 와서 같이 카공을 할 수
    있는 환경을 만들어주기 위한 카공 및 친목 동아리입니다. 직접 제작한 웹
    사이트를 통해 동아리를 체계적으로 관리하고 운영하고 있고, 동아리원 분은
    원하는 장소와 시간에 미리 투표하여 스터디에 참여할 수 있습니다. 또한
    출석체크나 참여율 관리를 포함하여 여러가지 컨텐츠를 제공하고 있고, 카공 뿐만
    아니라 밥을 먹거나, 보드게임, 뒤풀이 등의 모임도 같이 열리고 있습니다.
    <br />
    <br />
    ☕️가입조건☕️ <br /> <br />
    카공 모임이 메인이 되는 동아리이기 때문에 한 달에 최소 2회 이상 스터디에
    참여 가능한 20대 대학생(졸업생)만 받고 있고, 카공 스터디 이외의 불온한
    목적의 가입자를 엄격하게 금하고 있습니다. 웹 사이트 내에도 익명의 신고
    기능이 존재하고, 종교/정치 문제를 포함하여 타인에게 피해나 불쾌감을 주는
    행위는 즉각 추방됨을 미리 말씀드립니다. <br />
    <br />
    ☕️모임장소☕️ <br /> <br />
    수원: 아주대/수원역/수원시청역/광교중앙역/망포역/송죽동 <br />
    양천구: 당산역/오목교역/등촌역/까치산역 <br />
    안양: 안양역/인덕원역/범계역/금정역
    <br />
    <br />
    미리 궁금하실 분들을 위해 웹 사이트 링크를 걸어두겠습니다. 합격 발표
    이전까지는 반드시 게스트 로그인으로 접속해서 확인해주시기 바랍니다.
    studyabout.club <br />
    <br />
    ☕️가입비☕️ <br />
    <br /> 1000원의 가입비가 있습니다. 이벤트와 서버 운용에 사용됩니다. <br />
    <br />
    ☕️가입 신청☕️ <br />
    <br />
    https://docs.google.com/forms/d/1xfTAoxuJJy9KBlhg8eAekB8E7XSk0s9TZwhPQ3z4eh4/edit#responses
    <br />
    <br />
    ☕️관련문의☕️
    <br />
    <br />
    https://open.kakao.com/o/s36ysnpe
  </P>
);

const P = styled.p`
  padding: 8px 4px;
  border-radius: 12px;
  height: 174px;

  overflow-y: auto;
  background-color: var(--font-h7);
`;

export const PROMOTION_TEXT = `☕️소개 및 활동내용☕️

카공을 위한 모임은 많지만 제대로 운영되는 모임은 거의 없다는 걸 아시나요? 저희 About는 근처에 사는 대학생들이 편하게 와서 같이 카공을 할 수 있는 카공 및 친목 동아리입니다.

투표 시스템과 출석체크, 참여율 관련 규칙 등을 통해 동아리를 체계적으로 관리하고 운영하고 있고, 동아리원 분은 원하는 장소와 시간에 미리 투표하여 스터디에 참여할 수 있습니다. 카공 뿐만 아니라 밥을 먹거나, 보드게임, 뒤풀이 등의 모임도 같이 열리고 있습니다.

개설된지는 약 2년이 넘은 동아리이며, 계속적으로 지역과 규모를 확장하고 있습니다. 이번에 내부에서 재정비를 끝 마치고 다시 정식으로 오픈하게 되었습니다.

☕️모임장소☕️

수원: 아주대/수원역/수원시청역/광교중앙역/망포역/송죽동

양천구: 당산역/오목교역/등촌역/까치산역

안양: 안양역/인덕원역/범계역/금정역


☕️가입조건☕️

카공 모임이 메인이 되는 동아리이기 때문에 한 달에 최소 2회 이상 스터디에 참여 가능한 20대 대학생(졸업생)만 받고 있고, 카공 스터디 이외의 불온한 목적의 가입자를 엄격하게 금하고 있습니다. 혹시 모를 상황을 대비하여 익명의 신고 기능이 존재하고, 종교/정치 문제를 포함하여 타인에게 피해나 불쾌감을 주는 행위는 즉각 추방됨을 미리 말씀드립니다.

미리 궁금하실 분들을 위해 웹 사이트 링크를 걸어두겠습니다.
합격 발표 이전까지는 반드시 '게스트 로그인'으로 접속해서 확인해주시기 바랍니다.
https://votehelper.herokuapp.com

☕️운영주체☕️

해당 동아리는 대학생들에 의해 자치적으로 운영되며 종교, 정치, 시민단체와 전혀 관련이 없음을 밝힙니다.

☕️회비☕️

2000원의 가입비와 3000원의 스터디 보증금이 있습니다. 모인 금액은 동아리 내의 이벤트에 사용되고, 스터디 보증금은 체계적인 스터디 관리를 위해 받습니다. 해당 사용 내역은 동아리원에게 투명하게 공개됩니다. 규칙에 따라 300원 ~ 1000원 사이의 스터디 벌금을 부여받을 수 있습니다. 다만 가입 첫 달산은 벌금을 부여하지 않고, 개인의 보증금은 탈퇴시 환급받을 수 있습니다. 

☕️가입 신청☕️

아래의 구글폼으로 가입신청을 해주시면 됩니다. 매주 화요일과 토요일에 합격자분들께 연락을 드립니다. 모집은 항시 진행중이고, 마감되는 경우 별도로 작성하겠습니다.

https://docs.google.com/forms/d/1xfTAoxuJJy9KBlhg8eAekB8E7XSk0s9TZwhPQ3z4eh4/edit#responses

☕️관련문의☕️

https://open.kakao.com/o/s36ysnpe
`;
