import styled from "styled-components";

export const ACCOUNT = "1002-364-221277 우리은행 이승주(어바웃)";
export const ACCOUNT_SHORT = "1002-364-221277 우리은행 어바웃";

export const PromotionComponent = () => <P>{PROMOTION_TEXT}</P>;

const P = styled.pre`
  padding: var(--padding-md);
  border-radius: var(--border-radius-sub);
  height: 169px;
  overflow-y: auto;
  font-size: 12px;
  background-color: var(--input-bg);
`;

export const PROMOTION_TEXT = `안녕하세요! 저희는 카공 스터디로 시작했다가 어짜다보니 200명 이상 규모의 카공 및 친목 동아리가 되어버린 ABOUT입니다. 같이 카공하실 분도, 카공을 명분으로 놀러 가실 분도 모두들 환영합니다 😊

☕️동아리 소개☕️
✔ 개인 공부에 집중도 할 수 있고, 소소하게 얘기도 할 수 있는 적당한 분위기의 스터디
✔ 지역별로 장소가 분류되어 있어 쉽게 참여할 수 있는 스터디
✔ 원하는 날짜와 시간에 자율적으로 투표하고 참여할 수 있는 스터디
✔ 비슷한 또래, 비슷한 전공이나 관심사를 가진 친구를 만날 수 있는 동아리
✔ 카공 뿐만 아니라 다양한 오프라인 모임(번개/정모) 진행
✔ 다양한 컨텐츠와 항시 진행중인 이벤트
✔ 웹 서비스를 통한 체계적인 운영

☕️모임 장소☕️
1. 수원
아주대/수원역/수원시청역/광교중앙역/경희대/송죽동

2. 양천구
당산역/오목교역/등촌역/까치산역

3. 안양(오픈 준비중, 신청 가능)
안양역/인덕원역/범계역/금정역

4. 강남(오픈 준비중, 아직 신청 불가)

☕️가입 조건☕️
1. 한 달에 최소 1회 이상 카공 스터디에 참여 가능한 20대 대학생(졸업생)

2. 불온한 목적의 가입자를 엄격하게 금지함(진짜 가만 안둠)

3. 타인에게 피해나 불쾌감을 주는 행위는 발각시 즉각 추방 !

☕️회비☕️
2000원의 가입비 + 3000원의 보증금(환급 가능)
보증금은 스터디 규칙과 관련하여 200 ~ 1000원의 벌금이 부여될 수 있음

☕️가입 문의 및 동아리 구경☕️
아래 링크에서 '게스트 로그인'을 통해 구경하거나, '카카오 로그인'을 통해 가입 신청 가능

https://studyabout.club

☕️관련문의☕️

https://open.kakao.com/o/sjDgVzmf

✔ 혹시하는 마음에 한번 더 언급하자면 신천지아니고, 웹 사이트 상에서의 프로필도 모두 오픈되어 있어요! 관련해서 문의하지 말아주세요...🥲
`;
