export const MAJOR_DATA = [
  {
    department: "인문계열",
    details: ["국어/국문학", "영어/영문학", "기타 외국어/문학", "인문과학"],
  },
  {
    department: "사회계열",
    details: ["경영/경제", "법률", "사회과학", "기타"],
  },
  {
    department: "교육계열",
    details: ["교육일반", "유아교육", "특수교육", "초등교육", "중등교육"],
  },
  {
    department: "공학계열",
    details: [
      "건축",
      "토목/도시",
      "교통/운송",
      "기계/금속",
      "전기/전자",
      "정밀/에너지",
      "소재/재료",
      "컴퓨터/통신",
      "산업",
      "화공",
      "기타",
    ],
  },
  {
    department: "자연계열",
    details: ["농림/수산", "생물/화학/환경", "생활과학", "수학/물리/천문/지리"],
  },
  {
    department: "의약계열",
    details: ["의료", "간호", "약학", "치료/보건", "기타"],
  },
  {
    department: "예체능계열",
    details: [
      "디자인",
      "응용예술",
      "무용/체육",
      "미술/조형",
      "연극/영화",
      "음악",
      "기타",
    ],
  },
];

export const InterestData = [
  "학교 공부",
  "코딩",
  "디자인",
  "블로그 포스팅",
  "영어 자격증",
  "국가 자격증",
  "독서",
  "다이어리",
  "콘텐츠 감상",
  "직장 업무",
  "취업 준비",
  "자기 계발",
];
