export const noticeData = [
  {
    id: "1",
    title: "동아리 리모델링 !!",
    category: "main",
    content:
      "안녕하세요! 준비하고 있던 리모델링 초기버전이 1차적으로 완성됐습니다. 아직 많이 부족하지만 계속해서 발전해 나갈 수 있도록 할 거고, 4~5월 중에는 다른 지역까지의 확장을 시도하고 있습니다. 또한 최근에 스터디 체계 관리를 거의 못했는데, 4월부터는 스터디 규칙에 따라 자동화되어 서비스가 운영될거예요. 기존에 열심히 안 나오시던 분들은 열심히 나올 수 있는 기회가 됐으면 좋겠습니다. 다들 이렇게 만나뵐 수 있게 되어 정말 반갑고 잘 부탁드립니다!",
    date: "2023-03-25",
  },
  {
    id: "2",
    title: "이벤트 관련",
    category: "sub",
    content:
      "건의하기 이벤트는 항시 지속되는 이벤트이고, 동아리 홍보글 작성 이벤트는 4월 5일까지만 신청을 받을게요! 신청일 기준이고, 신청을 희망하시는 분은 갠톡주세요!  ",
    date: "2023-03-28",
  },
  {
    id: "3",
    title: "4월 2일 변경 내용",
    category: "sub",
    content:
      "'수원시청역-커피빈' 장소 추가, 달력에 스터디 참여 마크 표시 '임시' 삭제, 스터디 규칙 업데이트, 스터디 상세페이지 및 유저 프로필 모달 수정",
    date: "2023-04-02",
  },
  {
    id: "4",
    title: "스터디 관리 시작합니다 !",
    category: "main",
    content:
      "스터디 규칙에 따른 관리를 4월 6일부터 시작합니다. 메인 페이지 우측 상단의 규칙을 확인하시고 경고를 받는 일이 없도록 주의해주세요! 또한 열심히 참여하라고 점수 시스템을 만들었어요 ㅎㅎ 점점 재밌는 컨텐츠를 많이 만들 수 있도록 해볼게요! 경고와 점수 모두 자동적으로 채점되기 때문에 혹시나 잘못 채점되는 경우가 있다면 저에게 말씀해주세요~! 그럼 다들 파이팅입니다 😊",
    date: "2023-04-05",
  },
  {
    id: "5",
    title: "동아리 확장 및 홍보",
    category: "main",
    content:
      "다음주부터 본격적으로 스터디 지역 확장 및 홍보를 시작합니다. 혼자서는 불가능해요 ㅠ 동아리원 분들 모두의 도움이 필요합니다! 다들 많이 도와주시면 감사하겠습니다 😊",
    date: "2023-04-15",
  },
  {
    id: "6",
    title: "양천구/당산 지역 확장",
    category: "sub",
    content: "4월 18일부로 양천구/당산 지역으로 스터디 확장했습니다!",
    date: "2023-04-18",
  },
  {
    id: "7",
    title: "다음 지역 확장 예정",
    category: "sub",
    content:
      "다음 확장 지역은 5월 중에 안양으로 계획하고 있습니다. 자세한 내용은 이후에 다시 언급할 수 있도록 하겠습니다.",
    date: "2023-04-20",
  },
];
