export const noticeData = [
  {
    id: "1",
    title: "동아리 리모델링 !!",
    category: "main",
    content:
      "안녕하세요! 준비하고 있던 리모델링 초기버전이 1차적으로 완성됐습니다. 아직 많이 부족하지만 계속해서 발전해 나갈 수 있도록 할 거고, 4~5월 중에는 다른 지역까지의 확장을 시도하고 있습니다. 또한 최근에 스터디 체계 관리를 거의 못했는데, 4월부터는 스터디 규칙에 따라 자동화되어 서비스가 운영될거예요. 기존에 열심히 안 나오시던 분들은 열심히 나올 수 있는 기회가 됐으면 좋겠습니다. 다들 이렇게 만나뵐 수 있게 되어 정말 반갑고 잘 부탁드립니다!",
    date: "2023-03-25",
  },
  {
    id: "2",
    title: "이벤트 관련",
    category: "sub",
    content:
      "건의하기 이벤트는 항시 지속되는 이벤트이고, 동아리 홍보글 작성 이벤트는 4월 5일까지만 신청을 받을게요! 신청일 기준이고, 신청을 희망하시는 분은 갠톡주세요!  ",
    date: "2023-03-28",
  },
  {
    id: "3",
    title: "4월 2일 변경 내용",
    category: "sub",
    content:
      "'수원시청역-커피빈' 장소 추가, 달력에 스터디 참여 마크 표시 '임시' 삭제, 스터디 규칙 업데이트, 스터디 상세페이지 및 유저 프로필 모달 수정",
    date: "2023-04-02",
  },
  {
    id: "4",
    title: "스터디 관리 시작합니다 !",
    category: "main",
    content:
      "스터디 규칙에 따른 관리를 4월 6일부터 시작합니다. 메인 페이지 우측 상단의 규칙을 확인하시고 경고를 받는 일이 없도록 주의해주세요! 또한 열심히 참여하라고 점수 시스템을 만들었어요 ㅎㅎ 점점 재밌는 컨텐츠를 많이 만들 수 있도록 해볼게요! 경고와 점수 모두 자동적으로 채점되기 때문에 혹시나 잘못 채점되는 경우가 있다면 저에게 말씀해주세요~! 그럼 다들 파이팅입니다 😊",
    date: "2023-04-05",
  },
  {
    id: "5",
    title: "동아리 확장 및 홍보",
    category: "main",
    content:
      "다음주부터 본격적으로 스터디 지역 확장 및 홍보를 시작합니다. 혼자서는 불가능해요 ㅠ 동아리원 분들 모두의 도움이 필요합니다! 다들 많이 도와주시면 감사하겠습니다 😊",
    date: "2023-04-15",
  },
  {
    id: "6",
    title: "양천구/당산 지역 확장",
    category: "sub",
    content: "4월 18일부로 양천구/당산 지역으로 스터디 확장했습니다!",
    date: "2023-04-18",
  },
  {
    id: "7",
    title: "다음 지역 확장 예정",
    category: "sub",
    content:
      "다음 확장 지역은 5월 중에 안양으로 계획하고 있습니다. 자세한 내용은 이후에 다시 언급할 수 있도록 하겠습니다.",
    date: "2023-04-20",
  },
  {
    id: "8",
    title: "신규 컨텐츠",
    category: "main",
    content:
      "참여 기록 페이지, 랭킹 페이지, 스토어 페이지 추가 + 유저 아바타 프로필 선택 기능 오픈",
    date: "2023-04-27",
  },
  {
    id: "9",
    title: "수원 장소 추가",
    category: "sub",
    content:
      "망포역 - 할리스, 송죽동 - 커피빈 장소 추가. 5월 중 서수원 지역도 추가 예정",
    date: "2023-05-02",
  },
  {
    id: "10",
    title: "이벤트! 치킨!!",
    category: "event",
    content:
      "에브리타임 홍보 게시판에 동아리 홍보글을 올려주신 분들에게 10 point 뿐만 아니라, 추첨을 통해 두 분께 황금 올리브 치킨 세트 기프티콘을 드려요! 관련 내용은 마이페이지 → 홍보 리워드를 통해 신청해주시면 됩니다! 기존에 올려주셨던 분들은 바로 리워드 신청 눌러주시면 돼요! 그리고 여러번 지원 가능합니다! 도배가 되지 않도록 검색해보시고 3일 정도의 텀은 가져주세요!",
    date: "2023-05-02",
  },
  {
    id: "11",
    title: "컨텐츠 오픈",
    category: "main",
    content:
      "친구, 모임, 광장 관련 컨텐츠들이 생겼어요. 아직 완성된 기능들이 아니지만, 미리 체험해볼 수 있도록 올려두었습니다. 완전한 서비스까지는 시간이 조금 걸릴 수 있어요 ㅎㅎ... 이에 따라 전체적인 인터페이스도 변경중입니다. 건의사항이나 오류사항이 있다면 알려주세요!",
    date: "2023-06-01",
  },
  {
    id: "12",
    title: "홍보글 작성해주실 분",
    category: "sub",
    content:
      "동아리 홍보 글 작성해 주실 분을 구해요! 기존 글에서 수정만 하는것이기 때문에 어떤 내용을 넣을지 자체는 크게 고민하지 않아도 될 거예요...! 제가 이런 거 잘 못 써서 ㅜㅜ 갠톡으로 연락주시면 사례로 만원 기프티콘드려요! 편하게 연락주세요~",
    date: "2023-06-01",
  },
  {
    id: "13",
    title: "시험기간 두근두근 랜덤 선물 이벤트",
    category: "event",
    content:
      "이번에도 단톡방에서 일주일간 시험기간 두근두근 랜덤 선물 이벤트 진행합니다! 다들 시험기간 파이팅~! (곧 종강이에요 두근두근) 한번 받으신 분들은 다음꺼엔 양보해주시면 감사합니당 :)",
    date: "2023-06-01",
  },
];
