import styled from "styled-components";
export const ACCOUNT = "1002-364-221277 우리은행 이승주(어바웃)";
export const ACCOUNT_SHORT = "1002-364-221277 우리은행 어바웃";

export const REGISTER_AGE_MIN = 12;

export const PromotionComponent = () => <P>{PROMOTION_TEXT}</P>;

const P = styled.p`
  padding: var(--padding-md);
  border-radius: var(--border-radius-sub);
  height: 240px;
  overflow-x: auto;
  overflow-y: auto;
  font-size: 12px;
  background-color: var(--input-bg);
`;

export const OPEN_KAKAO_LINK = "https://open.kakao.com/o/sjDgVzmf";

export const PROMOTION_TEXT = `🌟 안녕하세요! 카공 및 친목 동아리 ABOUT입니다! 🌟
 
저희 동아리는 카공 스터디와 다양한 오프라인 모임을 통해 공부와 친목을 모두 챙길 수 있는 대학교 연합 동아리입니다. 공부를 목적으로 하시는 분도, 카공과 함께 동네 친구를 만들고 싶은 분도 모두 환영합니다! 🎉📚


📢 어바웃 동아리 소개 📢

✔ 개인 공부와 소소한 대화가 공존하는 스터디 분위기
✔ 원하는 날짜, 시간, 장소로 자유롭게 스터디 참여
✔ 지역, 또래, 전공, 관심사를 공유하는 친구들과의 만남
✔ 다양한 오프라인 모임과 이벤트
✔ 체계적인 운영과 관리 체계
✔ 열심히 공부한 뒤 같이 놀기도 하는 동아리


☕️ 가입 조건 ☕️

✅한 달에 최소 1회 이상 카공 스터디에 참여 가능한 분
✅만 19~26세의 대학생(졸업생)

🚨금전, 종교, 이성 등 불온한 목적의 가입자를 엄격히 금지합니다. (동아리 웹 사이트에 모든 회원의 프로필이 공개되어 있으며, 타 회원 신고와 거리두기 기능이 마련되어 있습니다.)

🚨타인에게 피해나 불편함을 주는 행위는 즉각 추방됩니다. 


☕️ 모임 장소 ☕️

-수원 지역: 아주대, 수원역, 경희대, 수원시청역, 상현역, 광교역, 송죽동, 구운동

-양천＆영등포 지역: 당산역, 오목교역, 영등포구청역, 등촌역, 신도림역, 여의도역, 까치산역, 화곡동

-안양 지역: 안양역, 인덕원역, 범계역, 금정역

-강남 지역: 강남역, 논현역, 양재역, 선릉역, 강남구청역, 신논현역, 교대역

-동대문/성북구 지역: 모집중

-마포/서대문구 지역: 모집중

‼️스터디 지역은 계속 확장되는 중입니다.‼️


☕️ 회비 ☕️

가입비: 2000원
보증금: 3000원 (환급 가능)

*안양 지역은 가입비/보증금 무료
*보증금에서 스터디 규칙에 따라 벌금이 부여될 수 있음 
(100 ~ 1000원)

📝 가입 신청 및 동아리 구경 📝
https://studyabout.club

가입 신청: '카카오 로그인'
동아리 구경: '게스트 로그인'

🔵 저희는 교내 동아리가 아닌 대학교 연합동아리입니다.
🔵 오픈 지역은 지속적으로 추가 및 확장 중에 있습니다!
🔵 ABOUT은 특정 종교, 정치, 시민 단체와 관련 없는 건전한 연합동아리로, 다양한 관심사와 배움을 추구하는 대학생들을 환영합니다. 동아리 관련 문의는 링크를 통해 해주세요.
https://open.kakao.com/o/sjDgVzmf


`;
